N, r, c = map(int, input().split())
x = c+1
y = r+1
n = 0

# 2^N * 2^N 크기의 맵
# N번 몇 사분면인지 확인하기
# (-,-) = 1, (+,-)=2, (-,+)=3, (+,+)=4

while N:
    if x%(2**N) in range(1, int(2**(N-1)+1)):
        q1 = 'l'
    else:
        q1 = 'r'
    if y%(2**N) in range(1, int(2**(N-1)+1)):
        q2 = 'u'
    else:
        q2 = 'd'


    if q1 == 'l':
        if q2 == 'u':
            n += 0
        else:
            n += 2**(2*(N-1))*2
    else:
        if q2 == 'u':
            n += 2**(2*(N-1))
        else:
            n += 2**(2*(N-1))*3
    
    N -= 1

print(n)


## 메모장에 적은 내용
# N = 3 -> 64
# 4 > 1 > 2

# 16*3 + 4*0 + 1*1 = 49
# 2^4, 2^2, 2^0

# 사분면 판단 기준
# N/2보다 크냐 작냐 
# 1 2 3 4 5 6 7 8

# 1234 5678  -> 나누기 8했을 때 나머지가 1,2,3,4/5,6,7,0
# 12,56 / 34,78 -> 나누기 4했을 때 나머지가 1,2 / 3,0
# 1,3,5,7 / 2,4,6,8-> 나누기 2했을 때 나머지가 1/0

# 1 2 3 4
# 12 / 34 -> 나누기 4했을 때 나머지가 1,2/3,0
# 1,3/2,4 -> 나누기 2했을 때 나머지가 1,0










